namespace PalTas;

public static partial class TasScript
{
    public enum TasProgress
    {
        // 无用进度
        NULL = -1,
        // 李逍遥首次出房间
        见石碑篇_出房间,
        // 去二楼楼道接客，得到 500 文
        见石碑篇_接客,
        // 下楼向右下直走，尽头的箱子里呦还魂香
        见石碑篇_下楼直走还魂香,
        // 李大娘发现乞丐在门口影响生意，吩咐我们把乞丐赶走
        见石碑篇_大娘吩咐赶乞丐,
        // 驱赶乞丐，乞丐讨酒
        见石碑篇_赶乞丐,
        // 眼见乞丐难缠，只好先去厨房给大娘打下手
        见石碑篇_去厨房帮大娘打下手,
        // 大娘吩咐送餐
        见石碑篇_端酒菜,
        // 将酒菜送到苗人拳房间
        见石碑篇_送餐,
        // 苗人拳房间床头藏着十里香
        见石碑篇_拿十里香,
        // 将桂花酒交于酒剑仙，谁知他竟一口喝完
        见石碑篇_将桂花酒交于酒剑仙,
        // 李大娘在厨房唤逍遥，不予理会直接出门
        见石碑篇_不予理会直接出门,
    }
}
