using PalTas.Records;

namespace PalTas;

public static partial class TasScript
{
    /// <summary>
    /// 队伍行进路径和滑步取物
    /// </summary>
    public static Dictionary<TasProgress, TasWalkPath[][]> TasWalkPlans { get; private set; } = new()
    {
        [TasProgress.见石碑篇_出房间] = [
            [
                // ↓前往门口的场景切换点
                new(1216, 352),
                // ↓前往门口的场景切换点
                new(1264, 376),
                // ↓前往门口的场景切换点
                new(1232, 360),
                // ↓前往门口的场景切换点
                new(1184, 384),
            ],
            [
                // ↓前往门口的场景切换点
                new(1168, 376),
            ],
        ],
        [TasProgress.见石碑篇_接客] = [
            [
                // ←前往隔壁门口
                // ↓切身位，避开 NPC 们
                new(1424, 1448, SceneId: 4),
                // ←前往楼道尽头
                new(1200, 1336),
                // ↓前往楼梯口
                new(1152, 1360),
            ],
        ],
        [TasProgress.见石碑篇_下楼直走还魂香] = [
            [
                // →下楼
                new(1168, 1368),
                // →前往库房门口（↑自动上切纠正身位，因下楼被李大娘挤开了）
                new(1408, 1536),
                // →前往右边尽头的箱子附近
                new(1488, 1576),
                // →前往右边尽头的箱子（滑步取物）
                new(1552, 1608),
            ],
        ],
        [TasProgress.见石碑篇_大娘吩咐赶乞丐] = [
            [
                // ↓
                new(1536, 1616),
                // ↑回头一格，鬼畜一下。。。卡李大娘互动脚本更替时间
                new(1552, 1608),
                // ↓跑到尽头
                new(1232, 1768),
                // ←走到酒剑仙头边（多走一格）
                //new(1040, 1672),
                new(1024, 1664),
                // ↑走到李大娘面前
                //new(1104, 1640),
                new(1088, 1632),
            ],
        ],
        [TasProgress.见石碑篇_赶乞丐] = [
            [
                // ↓
                new(1024, 1664),
            ],
        ],
        [TasProgress.见石碑篇_去厨房帮大娘打下手] = [
            [
                // ↑门前等待法
                new(1168, 1592),
                // ←
                new(992, 1504),
                // ↑
                new(1008, 1496),
            ],
            [
                // ←
                new(992, 1488),
                // ←前往灶间门口
                new(496, 1192, SceneId: 2),
                // ↑找李大娘对话
                new(656, 1112),
                //new(672, 1104),
            ],
        ],
        [TasProgress.见石碑篇_端酒菜] = [
            [
                // ↓
                new(640, 1120),
                // →端酒菜
                new(656, 1128),
            ],
            [
                // ↓
                new(528, 1192),
                // →出厨房
                new(688, 1272),
            ],
        ],
        [TasProgress.见石碑篇_送餐] = [
            [
                // →
                new(1120, 1536),
                // ↑
                new(1264, 1464),
                // ←上楼梯
                new(1248, 1456),
                // ↑
                new(1200, 1336),
                // →
                new(1392, 1432),
                // ↑进苗人拳客房
                new(1440, 1408),
            ],
        ],
        [TasProgress.见石碑篇_拿十里香] = [
            [
                // ↑
                new(1376, 1040, SceneId: 2),
                // ↑
                new(1424, 1016),
                // →
                new(1456, 1032),
            ],
        ],
        [TasProgress.见石碑篇_将桂花酒交于酒剑仙] = [
            [
                // ←
                new(1424, 1016),
                // ↓出苗人拳客房
                new(1216, 1120),
                // ←
                new(1216, 1328, SceneId: 4),
                // ↓
                new(1152, 1360),
                // →下楼梯
                new(1168, 1368),
                // ↓
                new(1088, 1552),
                // →
                new(1168, 1592),
                // ↓走到足够向酒剑仙交付酒的位置
                new(1040, 1656),
            ],
        ],
        [TasProgress.见石碑篇_不予理会直接出客栈] = [
            [
                // ↓出客栈
                new(992, 1680),
                // ↓
                new(1136, 952, SceneId: 5),
                // →避开村花的诱惑
                new(1728, 1248),
                // ↓
                new(1456, 1384),
                // →走到集市口
                new(1568, 1440),
                // ↑进入集市
                new(1760, 1344),
            ],
            [
                // ↑
                new(864, 1344, SceneId: 6),
                // →去听水生叔吹牛
                new(1008, 1416),
                // ←来自张四哥的酸葡萄
                new(944, 1384),
                // ↓到猪肉张摊位拐弯
                new(624, 1544),
                // ←
                new(576, 1520),
                // ↓回村
                new(272, 1672),
            ],
        ],
        [TasProgress.见石碑篇_大娘病倒了回客栈探望王小虎] = [
            [
                // ↓村花：李大娘小睡片刻
                new(1584, 1448, SceneId: 5),
                // ←
                new(960, 1136),
                // ↑
                new(1264, 984),
                // ←
                new(1168, 936),
                // ↑进客栈
                new(1280, 880),
                // ↑
                new(1376, 1504, SceneId: 4),
                // ←
                new(1296, 1464),
                // ↑进李大娘房间
                new(1312, 1456),
                // ↑
                new(1264, 744, SceneId: 3),
                // ←拿还神丹
                new(1200, 712),
                // ↑拿驱魔香
                new(1344, 640),
                // ↑拿忘魂花
                new(1440, 688),
            ],
            [
                // ↓洪大夫爱莫能助
                new(1408, 704),
                // →感谢王小虎
                new(1424, 712),
            ],
            [
                // ←
                new(1408, 704),
                // ←
                new(1392, 696),
                // ↓出婶婶房间
                new(1216, 784),
                // ↓
                new(1104, 1560, SceneId: 4),
                // →
                new(1168, 1592),
                // ↓加个餐+出客栈💔
                //         肥雪春夜寄相思
                //                   仪拓诗
                // 孤枝欲静风催折，残瓦栖身雨打斜。
                // 薄躯未许承欢日，已作他人堂上价。
                //     寒枝无依靠，冷眼有讥声。
                //     逼嫁偿恩养，违心即弃行。
                //     雪深封去路，指冻裂残更。
                // 大洋隔断心悦人，一夜茫茫梦不成。
                new(992, 1680),
            ],
        ],
        [TasProgress.见石碑篇_张四哥救人如救驾] = [
            // 复用从客栈门口去集市
            null!,
            // 找张四哥借船
            [
                // ↑
                new(976, 1288, SceneId: 6),
                // →救人如救驾
                new(1104, 1352),
            ],
            [
                // →走吧上船
                new(1184, 1392),
            ],
        ],
        [TasProgress.见石碑篇_初登岛_过草妖] = [
            [
                // ↑
                new(1456, 456, SceneId: 15),
                // ←切身位绕开首个草妖
                new(400, 1656),
                // ↑必撞草妖
                //new(1088, 1312, SceneId: 16),
                // ↑
                new(1280, 1216, SceneId: 16),
                // →绕开一风一草
                new(1296, 1224),
                // ↑
                new(1472, 1136),
                // ←切身位绕开三草妖
                new(1440, 1120),
                // ↑进迷阵
                new(1792, 944),
            ],
        ],
        [TasProgress.见石碑篇_初登岛_过迷阵] = [
            [
                // ↑
                new(1456, 456, SceneId: 15),
                // ↑必撞草妖
                //new(1088, 1312, SceneId: 16),
                // ↑
                new(1280, 1216, SceneId: 16),
                // →绕开一风一草
                new(1296, 1224),
                // ↑
                new(1472, 1136),
                // ←切身位绕开三草妖
                new(1440, 1120),
                // ↑进迷阵
                new(1808, 952),
            ],
        ],
    };

    /// <summary>
    /// 初始化脚本模块
    /// </summary>
    public static void InitScriptWalkPlans()
    {
        // 复用从客栈门口去集市
        TasWalkPlans[TasProgress.见石碑篇_张四哥救人如救驾][0] = TasWalkPlans[TasProgress.见石碑篇_不予理会直接出客栈][0];
    }
}
