using PalTas.Records;

namespace PalTas;

public static partial class TasScript
{
    /// <summary>
    /// 队伍行进路径和滑步取物
    /// </summary>
    public static Dictionary<TasProgress, TasWalkPath[][]> TasWalkPlans { get; private set; } = new()
    {
        [TasProgress.见石碑篇_出房间] = [
            [
                // ↓前往门口的场景切换点
                new(1168, 376),
            ],
        ],
        [TasProgress.见石碑篇_接客] = [
            [
                // ←前往隔壁门口
                // ↓切身位，避开 NPC 们
                new(1424, 1448, SceneId: 4),
                // ←前往楼道尽头
                new(1200, 1336),
                // ↓前往楼梯口
                new(1152, 1360),
            ],
        ],
        [TasProgress.见石碑篇_下楼直走还魂香] = [
            [
                // →下楼
                new(1168, 1368),
                // →前往库房门口（↑自动上切纠正身位，因下楼被李大娘挤开了）
                new(1408, 1536),
                // →前往右边尽头的箱子附近
                new(1488, 1576),
                // →前往右边尽头的箱子（滑步取物）
                new(1552, 1608),
            ],
        ],
        [TasProgress.见石碑篇_大娘吩咐赶乞丐] = [
            [
                // ↓
                new(1536, 1616),
                // ↑回头一格，鬼畜一下。。。卡李大娘互动脚本更替时间
                new(1552, 1608),
                // ↓跑到尽头
                new(1232, 1768),
                // ←走到酒剑仙头边（多走一格）
                //new(1040, 1672),
                new(1024, 1664),
                // ↑走到李大娘面前
                //new(1104, 1640),
                new(1088, 1632),
            ],
        ],
        [TasProgress.见石碑篇_赶乞丐] = [
            [
                // ↓
                new(1024, 1664),
            ],
        ],
        [TasProgress.见石碑篇_去厨房帮大娘打下手] = [
            [
                // ↑门前等待法
                new(1168, 1592),
                // ←
                new(992, 1504),
                // ↑
                new(1008, 1496),
            ],
            [
                // ←
                new(992, 1488),
                // ←前往灶间门口
                new(496, 1192, SceneId: 2),
                // ↑找李大娘对话
                new(656, 1112),
                //new(672, 1104),
            ],
        ],
        [TasProgress.见石碑篇_端酒菜] = [
            [
                // ↓
                new(640, 1120),
                // →端酒菜
                new(656, 1128),
            ],
            [
                // ↓
                new(528, 1192),
                // →出厨房
                new(688, 1272),
            ],
        ],
        [TasProgress.见石碑篇_送餐] = [
            [
                // →
                new(1120, 1536),
                // ↑
                new(1264, 1464),
                // ←上楼梯
                new(1248, 1456),
                // ↑
                new(1200, 1336),
                // →
                new(1392, 1432),
                // ↑进苗人拳客房
                new(1440, 1408),
            ],
        ],
        [TasProgress.见石碑篇_拿十里香] = [
            [
                // ↑
                new(1376, 1040, SceneId: 2),
                // ↑
                new(1424, 1016),
                // →
                new(1456, 1032),
            ],
        ],
        [TasProgress.见石碑篇_将桂花酒交于酒剑仙] = [
            [
                // ←
                new(1424, 1016),
                // ↓出苗人拳客房
                new(1216, 1120),
                // ←
                new(1216, 1328, SceneId: 4),
                // ↓
                new(1152, 1360),
                // →下楼梯
                new(1168, 1368),
                // ↓
                new(1088, 1552),
                // →
                new(1168, 1592),
                // ↓走到足够向酒剑仙交付酒的位置
                new(1040, 1656),
            ],
        ],
        [TasProgress.见石碑篇_不予理会直接出门] = [
            [
                // ↓出客栈
                new(992, 1680),
                // ↓
                new(1136, 952, SceneId: 5),
                // →
                new(1728, 1248),
                // ↓
                new(1456, 1384),
                // →走到集市口
                new(1568, 1440),
                // ↑进入集市
                new(1760, 1344),
            ],
        ],
    };
}
