using PalTas.TasCore.Records;
using System.Collections.Generic;
using static Vanara.PInvoke.Gdi32;

namespace PalTas.TasCore;

public static partial class TasScript
{
    /// <summary>
    /// 队伍行进路径和滑步取物
    /// </summary>
    public static Dictionary<TasProgress, TasWalkPath[][]> TasWalkPlans { get; private set; } = new()
    {
        [TasProgress.见石碑篇_出房间] = [
            [
                // ↓出房间
                new(1168, 376),
            ],
        ],
        [TasProgress.见石碑篇_接客] = [
            [
                // ←前往隔壁门口
                // ↓切身位，避开 NPC 们
                new(1424, 1448, SceneId: 4),
                // ←前往楼道尽头
                new(1200, 1336),
                // ↓前往楼梯口
                new(1152, 1360),
            ],
        ],
        [TasProgress.见石碑篇_下楼直走还魂香] = [
            [
                // →下楼
                new(1168, 1368),
                // →前往库房门口（↑自动上切纠正身位，因下楼被李大娘挤开了）
                new(1408, 1536),
                // →前往右边尽头的箱子附近
                //new(1488, 1576),
                // →前往右边尽头的箱子（滑步取物）
                new(1552, 1608, NeedPreInput: true),
            ],
        ],
        [TasProgress.见石碑篇_大娘吩咐赶乞丐] = [
            [
                // ↓
                new(1536, 1616),
                // ↑回头一格，鬼畜一下。。。卡李大娘互动脚本更替时间
                new(1552, 1608),
                // ↓跑到尽头
                new(1232, 1768),
                // ←走到酒剑仙头边（多走一格）
                new(1040, 1672),
                //new(1024, 1664),
                // ↑走到李大娘面前
                new(1104, 1640),
            ],
        ],
        [TasProgress.见石碑篇_赶乞丐] = [
            [
                // ↓蹴尔而与之，乞人不屑也
                new(1040, 1672, NeedPreInput: true),
            ],
        ],
        [TasProgress.见石碑篇_去厨房帮大娘打下手] = [
            [
                // ↑门前等待法
                new(1168, 1592),
                // ←
                new(992, 1504),
                // ↑
                new(1008, 1496),
            ],
            [
                // ←
                new(992, 1488),
                // ←前往灶间门口
                new(496, 1192, SceneId: 2),
                // ↑找李大娘对话
                new(656, 1112, NeedPreInput: true),
            ],
        ],
        [TasProgress.见石碑篇_端酒菜] = [
            [
                // ↓
                new(640, 1120),
                // →端酒菜
                new(656, 1128, NeedPreInput: true),
            ],
            [
                // ↓
                new(528, 1192),
                // →出厨房
                new(688, 1272),
            ],
        ],
        [TasProgress.见石碑篇_送餐] = [
            [
                // →
                new(1120, 1536),
                // ↑
                new(1264, 1464),
                // ←上楼梯
                new(1248, 1456),
                // ↑
                new(1200, 1336),
                // →
                new(1392, 1432),
                // ↑进苗人拳客房
                new(1440, 1408),
            ],
        ],
        [TasProgress.见石碑篇_拿十里香] = [
            [
                // ↑
                new(1376, 1040, SceneId: 2),
                // ↑
                new(1424, 1016),
                // →
                new(1456, 1032, NeedPreInput: true),
            ],
        ],
        [TasProgress.见石碑篇_将桂花酒交于酒剑仙] = [
            [
                // ←
                new(1424, 1016),
                // ↓出苗人拳客房
                new(1216, 1120),
                // ←
                new(1216, 1328, SceneId: 4),
                // ↓
                new(1152, 1360),
                // →下楼梯
                new(1168, 1368),
                // ↓
                new(1088, 1552),
                // →
                new(1168, 1592),
                // ↓走到足够向酒剑仙交付酒的位置
                new(1040, 1656, NeedUseItemId: TasItems.桂花酒),
            ],
        ],
        [TasProgress.见石碑篇_不予理会直接出客栈] = [
            [
                // ↓出客栈
                new(992, 1680),
                // ↓
                new(1136, 952, SceneId: 5),
                // →避开村花的诱惑
                new(1728, 1248),
                // ↓
                new(1456, 1384),
                // →走到集市口
                new(1568, 1440),
                // ↑进入集市
                new(1760, 1344),
            ],
            [
                // ↑
                new(864, 1344, SceneId: 6),
                // →去听水生叔吹牛
                new(1008, 1416),
                // ←来自张四哥的酸葡萄
                new(944, 1384),
                // ↓到猪肉张摊位拐弯
                new(624, 1544),
                // ←
                new(576, 1520),
                // ↓回村
                new(272, 1672),
            ],
        ],
        [TasProgress.见石碑篇_大娘病倒了回客栈探望王小虎] = [
            [
                // ↓村花：李大娘小睡片刻
                new(1584, 1448, SceneId: 5),
                // ←
                new(960, 1136),
                // ↑
                new(1264, 984),
                // ←
                new(1168, 936),
                // ↑进客栈
                new(1280, 880),
                // ↑
                new(1376, 1504, SceneId: 4),
                // ←
                new(1296, 1464),
                // ↑进李大娘房间
                new(1312, 1456),
                // ↑
                new(1264, 744, SceneId: 3),
                // ←拿还神丹
                new(1200, 712, NeedPreInput: true),
                // ↑拿驱魔香
                new(1344, 640, NeedPreInput: true, Direction: TasDirection.Left),
                // ↑拿忘魂花
                new(1440, 688, NeedPreInput: true),
                // ↓洪大夫爱莫能助
                new(1408, 704),
                // →感谢王小虎
                new(1424, 712, NeedPreInput: true),
            ],
            [
                // ←
                new(1392, 696),
                // ↓出婶婶房间
                new(1216, 784),
                // ↓
                new(1104, 1560, SceneId: 4),
                // →
                new(1168, 1592),
                // ↓加个餐+出客栈💔
                //         肥雪春夜寄相思
                //                   仪拓诗
                // 孤枝欲静风催折，残瓦栖身雨打斜。
                // 薄躯未许承欢日，已作他人堂上价。
                //     寒枝无依靠，冷眼有讥声。
                //     逼嫁偿恩养，违心即弃行。
                //     雪深封去路，指冻裂残更。
                // 大洋隔断心悦人，一夜茫茫梦不成。
                new(992, 1680),
            ],
        ],
        [TasProgress.见石碑篇_张四哥救人如救驾] = [
            // 复用从客栈门口去集市
            null!,
            // 找张四哥借船
            [
                // ↑
                new(976, 1288, SceneId: 6),
                // →救人如救驾
                new(1104, 1352, NeedPreInput: true),
                // →走吧上船
                new(1184, 1392),
            ],
        ],
        [TasProgress.见石碑篇_初登岛_过草妖] = [
            [
                // ↑
                new(1456, 456, SceneId: 15),
                // ←切身位绕开首个草妖
                new(400, 1656),
                // ↑必撞草妖
                //new(1088, 1312, SceneId: 16),
                // ↑
                new(1280, 1216, SceneId: 16),
                // →绕开一风一草
                new(1296, 1224),
                // ↑
                new(1472, 1136),
                // ←切身位绕开三草妖
                new(1440, 1120),
                // ↑进迷阵
                new(1792, 944),
            ],
        ],
        [TasProgress.见石碑篇_初登岛_过迷阵] = [
            // 0 中岛，蛇纹之姬　圣灵之身
            [
                // ↑
                new(816, 1032, SceneId: 18),
                // ←
                new(800, 1024),
                // ↑
                new(880, 984),
                // →
                new(896, 992),
                // ↑到达中岛
                new(1024, 928),
            ],
            // 1 西疆斩风魔
            [
                // ←上芦苇漂 10
                new(944, 888),
                // ↑上芦苇漂 11
                new(864, 832),
                // ↓上芦苇漂 16
                new(672, 544),
                // →上岸
                new(576, 752),
                // ↓
                new(352, 864),
                // →砸石像 8
                new(544, 960, NeedUseItemId: TasItems.破天锤),
                // ←
                new(352, 864),
                // ↑
                new(576, 752),
                // ←上芦苇漂 16
                new(512, 720),
                // →上芦苇漂 11
                new(712, 548),
                // →上芦苇漂 10
                new(872, 852),
                // →回到中岛
                new(1024, 928),
            ],
            // 2 南山收土妖
            [
                // ↑上芦苇漂 15
                new(1024, 928),
                // →上芦苇漂 17
                new(1296, 824),
                // ↑到达迷阵南莲池
                new(1584, 1096),
                // →
                new(1600, 1104),
                // ↑
                new(1776, 1016),
                // ←
                new(1584, 920),
                // ↑砸石像 7
                new(1744, 840, NeedUseItemId: TasItems.破天锤),
                // ↓
                new(1584, 920),
                // →
                new(1776, 1016),
                // ↓
                new(1600, 1104),
                // ←
                new(1472, 1040),
                // ↓上芦苇漂 18
                new(992, 1280),
                // →
                new(1232, 1400),
                // ↑砸石像 9
                new(1440, 1296, NeedUseItemId: TasItems.破天锤),
                // ↓
                new(1232, 1400),
                // ←
                new(992, 1280),
                // ↑上芦苇漂 18
                new(1488, 1032),
                // ←上芦苇漂 19 20
                new(1096, 836),
            ],
            // 3 东海杀雷神
            [
                // ↑
                new(1200, 776),
                // →
                new(1216, 784),
                // ↑上芦苇漂 22
                new(1232, 776),
                // ↓上芦苇漂 26
                new(1296, 584),
                // ←上芦苇漂 26
                new(1040, 440),
                // ↑
                new(1088, 416),
                // →
                new(1200, 472),
                // ↑
                new(1264, 440),
                // →
                new(1312, 464),
                // ↑拿五张灵符 30
                new(1392, 424, NeedPreInput: true, Direction: TasDirection.Right),
            ],
            // 4 北荒伏火怪
            [
                // ↓
                new(1312, 464),
                // ←
                new(1264, 440),
                // ↓
                new(1200, 472),
                // ←
                new(1088, 416),
                // ↓
                new(1040, 440),
                // →上芦苇漂 26
                new(1312, 576),
                // ↑
                new(1696, 384),
                // ←砸石像 6
                new(1504, 288, NeedUseItemId: TasItems.破天锤),
            ],
            // 5 终以平水患
            [
                // →
                new(1696, 384),
                // ↓
                new(1408, 528),
                // →
                new(1344, 576),
                // ←
                new(1104, 728),
                // ↑
                new(1248, 656),
                // ←上芦苇漂 25
                new(1136, 600),
                // ↓上岸
                new(736, 496),
                // ←
                new(608, 432),
                // ↑
                new(752, 360),
                // ←砸石像 5
                new(528, 248, NeedUseItemId: TasItems.破天锤),
                // →
                new(752, 360),
                // ↓
                new(608, 432),
                // →
                new(736, 496),
                // ↑
                new(832, 448),
                // →上芦苇漂 25
                new(1248, 656),
                // ↓上芦苇漂 24
                new(1088, 736),
                // ←砸石像 4
                new(464, 504, NeedUseItemId: TasItems.破天锤),
                // →上芦苇漂 24
                new(560, 552),
            ],
            // 6 而大地重生
            [
                // ↓
                new(560, 552),
                // →
                new(1200, 776),
                // ↓
                new(1088, 832),
                // →
                new(1504, 1040),
                // ↓
                new(1488, 1048),
                // →
                new(1584, 1096),
                // ↓
                new(1472, 1152),
                // ←
                new(1456, 1144),
                // ←
                new(1264, 808),
                // ↓
                new(1040, 920),
                // ←
                new(1024, 912),
                // ←
                new(1856, 496),
            ],
        ],
    };

    /// <summary>
    /// 初始化脚本模块
    /// </summary>
    public static void InitScriptWalkPlans()
    {
        // 复用从客栈门口去集市
        TasWalkPlans[TasProgress.见石碑篇_张四哥救人如救驾][0] = TasWalkPlans[TasProgress.见石碑篇_不予理会直接出客栈][0];
    }
}
